In [2]:
import pandas as pd

In [1]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ['Linha' + str(i) for i in range(5)]

In [6]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [7]:
s =pd.Series(data = data, index = index)

In [8]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [9]:
s = pd.Series(data)

In [10]:
s1 = s + 2

In [11]:
s2 =  s + s1

In [12]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [13]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

In [14]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [15]:
df1 = pd.DataFrame(data = data)

In [16]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
index = ['Linha' + str(i) for i in range(3)]

In [18]:
df1 = pd.DataFrame(data = data, index = index)

In [19]:
columns = ['Coluna' + str(i) for i in range(3)]

In [20]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)

In [21]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [22]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [23]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [24]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [25]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [26]:
df1[df1 > 0] = 'A'
df1

        0  1  2
Linha0  A  A  A
Linha1  A  A  A
Linha2  A  A  A

In [27]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [28]:
df4 = pd.concat([df1, df2, df3])
df4

          0    1    2 Coluna0 Coluna1 Coluna2
Linha0    A    A    A     NaN     NaN     NaN
Linha1    A    A    A     NaN     NaN     NaN
Linha2    A    A    A     NaN     NaN     NaN
Linha0  NaN  NaN  NaN       B       B       B
Linha1  NaN  NaN  NaN       B       B       B
Linha2  NaN  NaN  NaN       B       B       B
Linha0  NaN  NaN  NaN       1       2       3
Linha1  NaN  NaN  NaN       4       5       6
Linha2  NaN  NaN  NaN       7       8       9

In [29]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

        0  1  2  Coluna0  Coluna1  Coluna2  Coluna0  Coluna1  Coluna2
Linha0  A  A  A        B        B        B        1        2        3
Linha1  A  A  A        B        B        B        4        5        6
Linha2  A  A  A        B        B        B        7        8        9